INSERT INTO tasks (name, description, created, done) VALUES ('Вынести мусор',
'Собрать мусор со всей квартиры, использовать мусорный мешок на 50 л, мусор вынести на позднее 11 часов',
'2023-01-01 00:01:01' , true);

INSERT INTO tasks (name, description, created, done) VALUES ('Помыть посуду',
'Поместить посуду в посудомоечную машину, добавить соли и чистящего средтсва, режим работы средний',
'2023-01-01 00:01:02' , true);
INSERT INTO tasks (name, description, created, done) VALUES ('Сделать уроки',
'Сделать уроки по истории и математике, подготовить реферат по философии',
'2023-01-01 00:01:03' , false);
INSERT INTO tasks (name, description, created, done) VALUES ('Выгулять хомяка',
 'Выгулять хомяка, заменить содержимое клетки, поменять воду и добавить корм',
 '2023-01-01 00:01:04' , false);
